BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Sensing.h
/***************************************************************************//**
* \file `$INSTANCE_NAME`_Sensing.h
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* \brief
* This file provides the headers of APIs specific to implementation of the
* sensing FW block.
*
* \see CapSense v`$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION` Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CY_CAPSENSE_`$INSTANCE_NAME`_SENSING_H)
#define CY_CAPSENSE_`$INSTANCE_NAME`_SENSING_H

#include "gpio/cy_gpio.h"
#include "cyfitter.h"
#include "syslib/cy_syslib.h"
#include "sysclk/cy_sysclk.h"
#include "`$INSTANCE_NAME`_Configuration.h"
#include "`$INSTANCE_NAME`_Structure.h"

#if (CY_CPU_CORTEX_M0P)
    #define `$INSTANCE_NAME`_CPU_CLOCK_FREQ_HZ  (CYDEV_CLK_SLOWCLK__HZ)
    #define `$INSTANCE_NAME`_CPU_CLOCK_FREQ_KHZ (CYDEV_CLK_SLOWCLK__KHZ)
    #define `$INSTANCE_NAME`_CPU_CLOCK_FREQ_MHZ (CYDEV_CLK_SLOWCLK__MHZ)
#else
    #define `$INSTANCE_NAME`_CPU_CLOCK_FREQ_HZ  (CYDEV_CLK_FASTCLK__HZ)
    #define `$INSTANCE_NAME`_CPU_CLOCK_FREQ_KHZ (CYDEV_CLK_FASTCLK__KHZ)
    #define `$INSTANCE_NAME`_CPU_CLOCK_FREQ_MHZ (CYDEV_CLK_FASTCLK__MHZ)
#endif

/****************************************************************************
* HW CSD Block Definition
****************************************************************************/
#define `$INSTANCE_NAME`_CSD_HW                             ((CSD_Type*)`$INSTANCE_NAME`_CSD__HW)

#define `$INSTANCE_NAME`_CSD_CONFIG_REG                     (`$INSTANCE_NAME`_CSD_HW->CONFIG)
#define `$INSTANCE_NAME`_CSD_CONFIG_PTR                     ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->CONFIG)
#define `$INSTANCE_NAME`_CSD_SPARE_REG                      (`$INSTANCE_NAME`_CSD_HW->SPARE)
#define `$INSTANCE_NAME`_CSD_SPARE_PTR                      ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SPARE)
#define `$INSTANCE_NAME`_CSD_STATUS_REG                     (`$INSTANCE_NAME`_CSD_HW->STATUS)
#define `$INSTANCE_NAME`_CSD_STATUS_PTR                     ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->STATUS)
#define `$INSTANCE_NAME`_CSD_STAT_SEQ_REG                   (`$INSTANCE_NAME`_CSD_HW->STAT_SEQ)
#define `$INSTANCE_NAME`_CSD_STAT_SEQ_PTR                   ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->STAT_SEQ)
#define `$INSTANCE_NAME`_CSD_STAT_CNTS_REG                  (`$INSTANCE_NAME`_CSD_HW->STAT_CNTS)
#define `$INSTANCE_NAME`_CSD_STAT_CNTS_PTR                  ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->STAT_CNTS)
#define `$INSTANCE_NAME`_CSD_RESULT_VAL1_REG                (`$INSTANCE_NAME`_CSD_HW->RESULT_VAL1)
#define `$INSTANCE_NAME`_CSD_RESULT_VAL1_PTR                ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->RESULT_VAL1)
#define `$INSTANCE_NAME`_CSD_RESULT_VAL2_REG                (`$INSTANCE_NAME`_CSD_HW->RESULT_VAL2)
#define `$INSTANCE_NAME`_CSD_RESULT_VAL2_PTR                ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->RESULT_VAL2)
#define `$INSTANCE_NAME`_CSD_ADC_RES_REG                    (`$INSTANCE_NAME`_CSD_HW->ADC_RES)
#define `$INSTANCE_NAME`_CSD_ADC_RES_PTR                    ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->ADC_RES)
#define `$INSTANCE_NAME`_CSD_INTR_REG                       (`$INSTANCE_NAME`_CSD_HW->INTR)
#define `$INSTANCE_NAME`_CSD_INTR_PTR                       ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->INTR)
#define `$INSTANCE_NAME`_CSD_INTR_SET_REG                   (`$INSTANCE_NAME`_CSD_HW->INTR_SET)
#define `$INSTANCE_NAME`_CSD_INTR_SET_PTR                   ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->INTR_SET)
#define `$INSTANCE_NAME`_CSD_INTR_MASK_REG                  (`$INSTANCE_NAME`_CSD_HW->INTR_MASK)
#define `$INSTANCE_NAME`_CSD_INTR_MASK_PTR                  ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->INTR_MASK)
#define `$INSTANCE_NAME`_CSD_INTR_MASKED_REG                (`$INSTANCE_NAME`_CSD_HW->INTR_MASKED)
#define `$INSTANCE_NAME`_CSD_INTR_MASKED_PTR                ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->INTR_MASKED)
#define `$INSTANCE_NAME`_CSD_HSCMP_REG                      (`$INSTANCE_NAME`_CSD_HW->HSCMP)
#define `$INSTANCE_NAME`_CSD_HSCMP_PTR                      ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->HSCMP)
#define `$INSTANCE_NAME`_CSD_AMBUF_REG                      (`$INSTANCE_NAME`_CSD_HW->AMBUF)
#define `$INSTANCE_NAME`_CSD_AMBUF_PTR                      ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->AMBUF)
#define `$INSTANCE_NAME`_CSD_REFGEN_REG                     (`$INSTANCE_NAME`_CSD_HW->REFGEN)
#define `$INSTANCE_NAME`_CSD_REFGEN_PTR                     ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->REFGEN)
#define `$INSTANCE_NAME`_CSD_CSDCMP_REG                     (`$INSTANCE_NAME`_CSD_HW->CSDCMP)
#define `$INSTANCE_NAME`_CSD_CSDCMP_PTR                     ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->CSDCMP)
#define `$INSTANCE_NAME`_CSD_SW_RES_REG                     (`$INSTANCE_NAME`_CSD_HW->SW_RES)
#define `$INSTANCE_NAME`_CSD_SW_RES_PTR                     ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_RES)
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_REG               (`$INSTANCE_NAME`_CSD_HW->SENSE_PERIOD)
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_PTR               ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SENSE_PERIOD)
#define `$INSTANCE_NAME`_CSD_SENSE_DUTY_REG                 (`$INSTANCE_NAME`_CSD_HW->SENSE_DUTY)
#define `$INSTANCE_NAME`_CSD_SENSE_DUTY_PTR                 ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SENSE_DUTY)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_REG                (`$INSTANCE_NAME`_CSD_HW->SW_HS_P_SEL)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_PTR                ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_HS_P_SEL)
#define `$INSTANCE_NAME`_CSD_SW_HS_N_SEL_REG                (`$INSTANCE_NAME`_CSD_HW->SW_HS_N_SEL)
#define `$INSTANCE_NAME`_CSD_SW_HS_N_SEL_PTR                ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_HS_N_SEL)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_REG              (`$INSTANCE_NAME`_CSD_HW->SW_SHIELD_SEL)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_PTR              ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_SHIELD_SEL)
#define `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_REG             (`$INSTANCE_NAME`_CSD_HW->SW_AMUXBUF_SEL)
#define `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_PTR             ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_AMUXBUF_SEL)
#define `$INSTANCE_NAME`_CSD_SW_BYP_SEL_REG                 (`$INSTANCE_NAME`_CSD_HW->SW_BYP_SEL)
#define `$INSTANCE_NAME`_CSD_SW_BYP_SEL_PTR                 ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_BYP_SEL)
#define `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_REG               (`$INSTANCE_NAME`_CSD_HW->SW_CMP_P_SEL)
#define `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_PTR               ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_CMP_P_SEL)
#define `$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_REG               (`$INSTANCE_NAME`_CSD_HW->SW_CMP_N_SEL)
#define `$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_PTR               ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_CMP_N_SEL)
#define `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_REG              (`$INSTANCE_NAME`_CSD_HW->SW_REFGEN_SEL)
#define `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_PTR              ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_REFGEN_SEL)
#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_REG              (`$INSTANCE_NAME`_CSD_HW->SW_FW_MOD_SEL)
#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_PTR              ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_FW_MOD_SEL)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_REG             (`$INSTANCE_NAME`_CSD_HW->SW_FW_TANK_SEL)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_PTR             ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_FW_TANK_SEL)
#define `$INSTANCE_NAME`_CSD_SW_DSI_SEL_REG                 (`$INSTANCE_NAME`_CSD_HW->SW_DSI_SEL)
#define `$INSTANCE_NAME`_CSD_SW_DSI_SEL_PTR                 ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SW_DSI_SEL)
#define `$INSTANCE_NAME`_CSD_IO_SEL_REG                     (`$INSTANCE_NAME`_CSD_HW->IO_SEL)
#define `$INSTANCE_NAME`_CSD_IO_SEL_PTR                     ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->IO_SEL)
#define `$INSTANCE_NAME`_CSD_SEQ_TIME_REG                   (`$INSTANCE_NAME`_CSD_HW->SEQ_TIME)
#define `$INSTANCE_NAME`_CSD_SEQ_TIME_PTR                   ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SEQ_TIME)
#define `$INSTANCE_NAME`_CSD_SEQ_INIT_CNT_REG               (`$INSTANCE_NAME`_CSD_HW->SEQ_INIT_CNT)
#define `$INSTANCE_NAME`_CSD_SEQ_INIT_CNT_PTR               ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SEQ_INIT_CNT)
#define `$INSTANCE_NAME`_CSD_SEQ_NORM_CNT_REG               (`$INSTANCE_NAME`_CSD_HW->SEQ_NORM_CNT)
#define `$INSTANCE_NAME`_CSD_SEQ_NORM_CNT_PTR               ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SEQ_NORM_CNT)
#define `$INSTANCE_NAME`_CSD_ADC_CTL_REG                    (`$INSTANCE_NAME`_CSD_HW->ADC_CTL)
#define `$INSTANCE_NAME`_CSD_ADC_CTL_PTR                    ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->ADC_CTL)
#define `$INSTANCE_NAME`_CSD_SEQ_START_REG                  (`$INSTANCE_NAME`_CSD_HW->SEQ_START)
#define `$INSTANCE_NAME`_CSD_SEQ_START_PTR                  ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->SEQ_START)
#define `$INSTANCE_NAME`_CSD_IDACA_REG                      (`$INSTANCE_NAME`_CSD_HW->IDACA)
#define `$INSTANCE_NAME`_CSD_IDACA_PTR                      ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->IDACA)
#define `$INSTANCE_NAME`_CSD_IDACB_REG                      (`$INSTANCE_NAME`_CSD_HW->IDACB)
#define `$INSTANCE_NAME`_CSD_IDACB_PTR                      ( (reg32 *) &`$INSTANCE_NAME`_CSD_HW->IDACB)

/****************************************************************************
* HW CSD Waveform Selection values
****************************************************************************/

