BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Sensing.h
#define `$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN           (0x00000000uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED         (0x00000001uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI1                  (0x00000002uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI2                  (0x00000003uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_HSCMP            (0x00000004uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_HSCMP            (0x00000005uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_HSCMP                 (0x00000006uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_SENSE_INV             (0x00000007uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_DELAY            (0x00000008uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_DELAY            (0x00000009uL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_INV              (0x0000000AuL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_INV              (0x0000000BuL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_HSCMP_INV        (0x0000000CuL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_HSCMP_INV        (0x0000000DuL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_HSCMP_INV             (0x0000000EuL)
#define `$INSTANCE_NAME`_CSD_WAVEFORM_SENSE                 (0x0000000FuL)

/****************************************************************************
* HW CSD Block Register Mask Definition
****************************************************************************/

/* CSD_CONFIG register masks */
#define `$INSTANCE_NAME`_CSD_CONFIG_IREF_SEL_MSK                    (CSD_CONFIG_IREF_SEL_Msk)
#define `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_2_CYCLES           (0x00000002Lu)
#define `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_3_CYCLES           (0x00000003Lu)
#define `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_4_CYCLES           (0x00000004Lu)
#define `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_MSK                (CSD_CONFIG_FILTER_DELAY_Msk)
#define `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_12MHZ              (`$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_2_CYCLES << CSD_CONFIG_FILTER_DELAY_Pos)
#define `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_24MHZ              (`$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_3_CYCLES << CSD_CONFIG_FILTER_DELAY_Pos)
#define `$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_48MHZ              (`$INSTANCE_NAME`_CSD_CONFIG_FILTER_DELAY_4_CYCLES << CSD_CONFIG_FILTER_DELAY_Pos)
#define `$INSTANCE_NAME`_CSD_CONFIG_SHIELD_DELAY_MSK                (CSD_CONFIG_SHIELD_DELAY_Msk)
#define `$INSTANCE_NAME`_CSD_CONFIG_SHIELD_DELAY_POS                (CSD_CONFIG_SHIELD_DELAY_Pos)
#define `$INSTANCE_NAME`_CSD_CONFIG_SENSE_EN_MSK                    (CSD_CONFIG_SENSE_EN_Msk)
#define `$INSTANCE_NAME`_CSD_CONFIG_SAMPLE_SYNC_MSK                 (CSD_CONFIG_SAMPLE_SYNC_Msk)
#define `$INSTANCE_NAME`_CSD_CONFIG_ENABLE_MSK                      (CSD_CONFIG_ENABLE_Msk)

/* CSD_STAT_SEQ register masks */
#define `$INSTANCE_NAME`_CSD_STAT_SEQ_SEQ_STATE_MSK                 (CSD_STAT_SEQ_SEQ_STATE_Msk)
#define `$INSTANCE_NAME`_ADC_STAT_SEQ_SEQ_STATE_MSK                 (CSD_STAT_SEQ_ADC_STATE_Msk)

/* CSD_RESULT_VAL1 register masks */
#define `$INSTANCE_NAME`_CSD_RESULT_VAL1_VALUE_MSK                  (CSD_RESULT_VAL1_VALUE_Msk)
#define `$INSTANCE_NAME`_CSD_RESULT_VAL1_BAD_CONVS_MSK              (CSD_RESULT_VAL1_BAD_CONVS_Msk)
#define `$INSTANCE_NAME`_CSD_RESULT_VAL1_BAD_CONVS_POS              (CSD_RESULT_VAL1_BAD_CONVS_Pos)

/* CSD_RESULT_VAL2 register masks */
#define `$INSTANCE_NAME`_CSD_RESULT_VAL2_VALUE_MSK                  (CSD_RESULT_VAL2_VALUE_Msk)

/* CSD_INTR register masks */
#define `$INSTANCE_NAME`_CSD_INTR_SAMPLE_MSK                        (CSD_INTR_SAMPLE_Msk)
#define `$INSTANCE_NAME`_CSD_INTR_INIT_MSK                          (CSD_INTR_INIT_Msk)
#define `$INSTANCE_NAME`_CSD_INTR_ADC_RES_MSK                       (CSD_INTR_ADC_RES_Msk)
#define `$INSTANCE_NAME`_CSD_INTR_ALL_MSK                           (CSD_INTR_SAMPLE_Msk | CSD_INTR_INIT_Msk | CSD_INTR_ADC_RES_Msk)

/* CSD_INTR_MASK register masks */
#define `$INSTANCE_NAME`_CSD_INTR_MASK_SAMPLE_MSK                   (CSD_INTR_MASK_SAMPLE_Msk)
#define `$INSTANCE_NAME`_CSD_INTR_MASK_INIT_MSK                     (CSD_INTR_MASK_INIT_Msk)
#define `$INSTANCE_NAME`_CSD_INTR_MASK_ADC_RES_MSK                  (CSD_INTR_MASK_ADC_RES_Msk)
#define `$INSTANCE_NAME`_CSD_INTR_MASK_CLEAR_MSK                    (0uL)

/* CSD_HSCMP register masks */
#define `$INSTANCE_NAME`_CSD_HSCMP_HSCMP_EN_MSK                     (CSD_HSCMP_HSCMP_EN_Msk)
#define `$INSTANCE_NAME`_CSD_HSCMP_HSCMP_INVERT_MSK                 (CSD_HSCMP_HSCMP_INVERT_Msk)
#define `$INSTANCE_NAME`_CSD_HSCMP_AZ_EN_MSK                        (CSD_HSCMP_AZ_EN_Msk)

/* CSD_AMBUF register masks */
#define `$INSTANCE_NAME`_CSD_AMBUF_PWR_MODE_OFF                     (0uL)
#define `$INSTANCE_NAME`_CSD_AMBUF_PWR_MODE_NORM                    (1uL)
#define `$INSTANCE_NAME`_CSD_AMBUF_PWR_MODE_HI                      (2uL)

/* CSD_REFGEN register masks */
#define `$INSTANCE_NAME`_CSD_REFGEN_REFGEN_EN_MSK                   (CSD_REFGEN_REFGEN_EN_Msk)
#define `$INSTANCE_NAME`_CSD_REFGEN_BYPASS_MSK                      (CSD_REFGEN_BYPASS_Msk)
#define `$INSTANCE_NAME`_CSD_REFGEN_VDDA_EN_MSK                     (CSD_REFGEN_VDDA_EN_Msk)
#define `$INSTANCE_NAME`_CSD_REFGEN_RES_EN_MSK                      (CSD_REFGEN_RES_EN_Msk)
#define `$INSTANCE_NAME`_CSD_REFGEN_GAIN_MSK                        (CSD_REFGEN_GAIN_Msk)
#define `$INSTANCE_NAME`_CSD_REFGEN_VREFLO_SEL_MSK                  (CSD_REFGEN_VREFLO_SEL_Msk)
#define `$INSTANCE_NAME`_CSD_REFGEN_VREFLO_INT_MSK                  (CSD_REFGEN_VREFLO_INT_Msk)

#define `$INSTANCE_NAME`_VREF_HI_OVERSHOOT_CORRECTION               (0x00000001uL)

#if(`$INSTANCE_NAME`_ENABLE != `$INSTANCE_NAME`_LP_MODE_EN)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_RES_CFG             (`$INSTANCE_NAME`_CSD_REFGEN_RES_EN_MSK)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_RES_CFG             (0u)
#endif /* (`$INSTANCE_NAME`_ENABLE != `$INSTANCE_NAME`_LP_MODE_EN) */

/* Vref Gain definition for the low voltage device operation (VDDA < 2V). */
#if(`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE)
    #define `$INSTANCE_NAME`_CSD_REFGEN_GAIN_LV                     (31uL)
#else
    #define `$INSTANCE_NAME`_CSD_REFGEN_GAIN_LV                     (21uL)
#endif /* (`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE) */

#if (`$INSTANCE_NAME`_2000_MV > `$INSTANCE_NAME`_CYDEV_VDDA_MV)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_GAIN                (`$INSTANCE_NAME`_CSD_REFGEN_GAIN_LV << CSD_REFGEN_GAIN_Pos)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_GAIN                (`$INSTANCE_NAME`_CSD_GAIN << CSD_REFGEN_GAIN_Pos)
#endif /* (`$INSTANCE_NAME`_2000_MV > `$INSTANCE_NAME`_CYDEV_VDDA_MV) */

#define `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_VREFLO_SEL              (((CSD_REFGEN_VREFLO_SEL_Msk >> CSD_REFGEN_VREFLO_SEL_Pos) - `$INSTANCE_NAME`_VREF_HI_OVERSHOOT_CORRECTION) <<  CSD_REFGEN_VREFLO_SEL_Pos)
#define `$INSTANCE_NAME`_CSD_REFGEN_NO_SHIELD_CFG                   (`$INSTANCE_NAME`_CSD_REFGEN_REFGEN_EN_MSK | `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_RES_CFG | `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_GAIN)
#define `$INSTANCE_NAME`_CSD_REFGEN_WITH_SHIELD_CFG                 (`$INSTANCE_NAME`_CSD_REFGEN_REFGEN_EN_MSK | `$INSTANCE_NAME`_CSD_REFGEN_RES_EN_MSK | `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_GAIN)

/* CSD_CSDCMP register masks */
#define `$INSTANCE_NAME`_CSD_CSDCMP_CSDCMP_DISABLED                 (0uL)
#define `$INSTANCE_NAME`_CSD_CSDCMP_CSDCMP_EN_MSK                   (CSD_CSDCMP_CSDCMP_EN_Msk)
#define `$INSTANCE_NAME`_CSD_CSDCMP_CMP_PHASE_FULL                  (0uL << CSD_CSDCMP_CMP_PHASE_Pos)
#define `$INSTANCE_NAME`_CSD_CSDCMP_CMP_PHASE_PHI1                  (1uL << CSD_CSDCMP_CMP_PHASE_Pos)
#define `$INSTANCE_NAME`_CSD_CSDCMP_CMP_PHASE_PHI2                  (2uL << CSD_CSDCMP_CMP_PHASE_Pos)
#define `$INSTANCE_NAME`_CSD_CSDCMP_CMP_PHASE_PHI1_2                (3uL << CSD_CSDCMP_CMP_PHASE_Pos)
#define `$INSTANCE_NAME`_CSD_CSDCMP_AZ_EN_MSK                       (CSD_CSDCMP_AZ_EN_Msk)

/* CSD_SENSE_PERIOD register masks */
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_SENSE_DIV_MSK             (CSD_SENSE_PERIOD_SENSE_DIV_Msk)
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_MSK             (CSD_SENSE_PERIOD_LFSR_SIZE_Msk)
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS             (CSD_SENSE_PERIOD_LFSR_SIZE_Pos)
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SCALE_MSK            (CSD_SENSE_PERIOD_LFSR_SCALE_Msk)
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_CLEAR_MSK            (CSD_SENSE_PERIOD_LFSR_CLEAR_Msk)
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_SEL_LFSR_MSB_MSK          (CSD_SENSE_PERIOD_SEL_LFSR_MSB_Msk)
#define `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_BITS_MSK             (CSD_SENSE_PERIOD_LFSR_BITS_Msk)

/* CSD_SENSE_DUTY register masks */
#define `$INSTANCE_NAME`_CSD_SENSE_DUTY_SENSE_WIDTH_MSK             (CSD_SENSE_DUTY_SENSE_WIDTH_Msk)
#define `$INSTANCE_NAME`_CSD_SENSE_DUTY_SENSE_POL_MSK               (CSD_SENSE_DUTY_SENSE_POL_Msk)
#define `$INSTANCE_NAME`_CSD_SENSE_DUTY_OVERLAP_PHI1_MSK            (CSD_SENSE_DUTY_OVERLAP_PHI1_Msk)
#define `$INSTANCE_NAME`_CSD_SENSE_DUTY_OVERLAP_PHI2_MSK            (CSD_SENSE_DUTY_OVERLAP_PHI2_Msk)

#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_OPEN        (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMPM_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPM_STATIC_CLOSE       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMPM_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_OPEN        (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMPT_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPT_STATIC_CLOSE       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMPT_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_OPEN        (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMPS_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMPS_STATIC_CLOSE       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMPS_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMA_STATIC_OPEN        (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMMA_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMA_STATIC_CLOSE       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMMA_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_OPEN        (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_P_SEL_SW_HMMB_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_P_SEL_SW_HMMB_STATIC_CLOSE       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_P_SEL_SW_HMMB_Pos)

#define `$INSTANCE_NAME`_CSD_SW_HS_N_SEL_SW_HCRH_STATIC_OPEN        (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_N_SEL_SW_HCRH_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_N_SEL_SW_HCRH_STATIC_CLOSE       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_N_SEL_SW_HCRH_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_N_SEL_SW_HCRL_STATIC_OPEN        (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_HS_N_SEL_SW_HCRL_Pos)
#define `$INSTANCE_NAME`_CSD_SW_HS_N_SEL_SW_HCRL_STATIC_CLOSE       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_HS_N_SEL_SW_HCRL_Pos)

#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_HSCMP            (`$INSTANCE_NAME`_CSD_WAVEFORM_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_PHI1             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1 << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_PHI2             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_PHI1_HSCMP       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_PHI2_HSCMP       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAV_STATIC_OPEN      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_SHIELD_SEL_SW_HCAV_Pos)

#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAG_HSCMP            (`$INSTANCE_NAME`_CSD_WAVEFORM_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAG_PHI1             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1 << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAG_PHI2             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAG_PHI1_HSCMP       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAG_PHI2_HSCMP       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_HSCMP << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCAG_STATIC_OPEN      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_SHIELD_SEL_SW_HCAG_Pos)

