BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Sensing.h
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_HSCMP            (`$INSTANCE_NAME`_CSD_WAVEFORM_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_PHI1             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1 << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_PHI2             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_PHI1_HSCMP       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_PHI2_HSCMP       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBV_STATIC_OPEN      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_SHIELD_SEL_SW_HCBV_Pos)

#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_HSCMP            (`$INSTANCE_NAME`_CSD_WAVEFORM_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_PHI1             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1 << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_PHI2             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_PHI1_HSCMP       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_PHI2_HSCMP       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_HSCMP << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)
#define `$INSTANCE_NAME`_CSD_SW_SHIELD_SEL_SW_HCBG_STATIC_OPEN      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_SHIELD_SEL_SW_HCBG_Pos)

#define `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_SW_IRLB_STATIC_CLOSE    (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_AMUXBUF_SEL_SW_IRLB_Pos)
#define `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_SW_IRH_STATIC_CLOSE     (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_AMUXBUF_SEL_SW_IRH_Pos)
#define `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_SW_ICB_PHI2             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_SW_AMUXBUF_SEL_SW_ICB_Pos)
#define `$INSTANCE_NAME`_CSD_SW_AMUXBUF_SEL_SW_DEFAULT              (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN)

/* CSD_SW_BYP_SEL register masks */
#define `$INSTANCE_NAME`_CSD_SW_BYP_SEL_SW_BYA_MSK                  (CSD_SW_BYP_SEL_SW_BYA_Msk)
#define `$INSTANCE_NAME`_CSD_SW_BYP_SEL_SW_BYB_MSK                  (CSD_SW_BYP_SEL_SW_BYB_Msk)

#define `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPM_STATIC_OPEN       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_P_SEL_SW_SFPM_Pos)
#define `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPM_STATIC_CLOSE      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_P_SEL_SW_SFPM_Pos)
#define `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPT_STATIC_OPEN       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_P_SEL_SW_SFPT_Pos)
#define `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPT_STATIC_CLOSE      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_P_SEL_SW_SFPT_Pos)
#define `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPS_STATIC_OPEN       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_P_SEL_SW_SFPS_Pos)
#define `$INSTANCE_NAME`_CSD_SW_CMP_P_SEL_SW_SFPS_STATIC_CLOSE      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_P_SEL_SW_SFPS_Pos)

#define `$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_OPEN       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_N_SEL_SW_SCRH_Pos)
#define `$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_N_SEL_SW_SCRH_Pos)
#define `$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_SW_SCRL_STATIC_OPEN       (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_SW_CMP_N_SEL_SW_SCRL_Pos)
#define `$INSTANCE_NAME`_CSD_SW_CMP_N_SEL_SW_SCRL_STATIC_CLOSE      (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_CMP_N_SEL_SW_SCRL_Pos)

/* CSD_SW_REFGEN_SEL register masks */
#define `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_IAIB_MSK              (CSD_SW_REFGEN_SEL_SW_IAIB_Msk)
#define `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_IBCB_MSK              (CSD_SW_REFGEN_SEL_SW_IBCB_Msk)
#define `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_SGMB_MSK              (CSD_SW_REFGEN_SEL_SW_SGMB_Msk)
#define `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_SGRP_MSK              (CSD_SW_REFGEN_SEL_SW_SGRP_Msk)
#define `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_SGRE_MSK              (CSD_SW_REFGEN_SEL_SW_SGRE_Msk)
#define `$INSTANCE_NAME`_CSD_SW_REFGEN_SEL_SW_SGR_MSK               (CSD_SW_REFGEN_SEL_SW_SGR_Msk)

#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1PM_MSK              (CSD_SW_FW_MOD_SEL_SW_F1PM_Msk)
#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1PM_STATIC_CLOSE     (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_F1PM_Pos)
#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1MA_MSK              (CSD_SW_FW_MOD_SEL_SW_F1MA_Msk)
#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1MA_STATIC_CLOSE     (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_F1MA_Pos)
#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1CA_MSK              (CSD_SW_FW_MOD_SEL_SW_F1CA_Msk)
#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1CA_STATIC_CLOSE     (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_MOD_SEL_SW_F1CA_Pos)
#define `$INSTANCE_NAME`_CSD_SW_FW_MOD_SEL_SW_F1CA_PHI2             (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_SW_FW_MOD_SEL_SW_F1CA_Pos)

#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2PT_MSK             (CSD_SW_FW_TANK_SEL_SW_F2PT_Msk)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE    (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2PT_Pos)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2MA_MSK             (CSD_SW_FW_TANK_SEL_SW_F2MA_Msk)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2MA_STATIC_CLOSE    (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2MA_Pos)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CA_MSK             (CSD_SW_FW_TANK_SEL_SW_F2CA_Msk)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CA_STATIC_CLOSE    (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2CA_Pos)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CB_MSK             (CSD_SW_FW_TANK_SEL_SW_F2CB_Msk)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CB_STATIC_CLOSE    (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2CB_Pos)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CA_PHI2            (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_SW_FW_TANK_SEL_SW_F2CA_Pos)
#define `$INSTANCE_NAME`_CSD_SW_FW_TANK_SEL_SW_F2CB_PHI2            (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_SW_FW_TANK_SEL_SW_F2CB_Pos)

#define `$INSTANCE_NAME`_CSD_TX_OUT_MSK                             (CSD_IO_SEL_CSD_TX_OUT_Msk)
#define `$INSTANCE_NAME`_CSD_TX_OUT_STATIC_OPEN                     (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_IO_SEL_CSD_TX_OUT_Pos)

#define `$INSTANCE_NAME`_CSD_TX_OUT_EN_MSK                          (CSD_IO_SEL_CSD_TX_OUT_EN_Msk)
#define `$INSTANCE_NAME`_CSD_TX_OUT_EN_PHI1_DELAY                   (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1_DELAY << 4u)
#define `$INSTANCE_NAME`_CSD_TX_AMUXB_EN_MSK                        (CSD_IO_SEL_CSD_TX_AMUXB_EN_Msk)
#define `$INSTANCE_NAME`_CSD_TX_AMUXB_EN_PHI2_DELAY                 (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2_DELAY << 12u)
#define `$INSTANCE_NAME`_CSD_TX_N_OUT_MSK                           (CSD_IO_SEL_CSD_TX_N_OUT_Msk)
#define `$INSTANCE_NAME`_CSD_TX_N_OUT_STATIC_OPEN                   (`$INSTANCE_NAME`_CSD_WAVEFORM_STATIC_OPEN << CSD_IO_SEL_CSD_TX_N_OUT_Pos)
#define `$INSTANCE_NAME`_CSD_TX_N_OUT_EN_MSK                        (CSD_IO_SEL_CSD_TX_N_OUT_EN_Msk)
#define `$INSTANCE_NAME`_CSD_TX_N_OUT_EN_PHI1                       (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI1 << CSD_IO_SEL_CSD_TX_N_OUT_EN_Pos)
#define `$INSTANCE_NAME`_CSD_TX_N_AMUXA_EN_MSK                      (CSD_IO_SEL_CSD_TX_N_AMUXA_EN_Msk)
#define `$INSTANCE_NAME`_CSD_TX_N_AMUXA_EN_PHI2                     (`$INSTANCE_NAME`_CSD_WAVEFORM_PHI2 << CSD_IO_SEL_CSD_TX_N_AMUXA_EN_Pos)

/* IDACB used */
#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN))
        #define `$INSTANCE_NAME`_IDACB_USED                         (1u)
#else
        #define `$INSTANCE_NAME`_IDACB_USED                         (0u)
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_COMP_EN) && \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_DEDICATED_IDAC_COMP_EN)) */

