BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Sensing.h
/* CSD_SEQ_INIT_CNT register masks */
#define `$INSTANCE_NAME`_CSD_SEQ_INIT_CNT_CONV_CNT_MSK              (CSD_SEQ_INIT_CNT_CONV_CNT_Msk)

/* CSD_SEQ_NORM_CNT register masks */
#define `$INSTANCE_NAME`_CSD_SEQ_NORM_CNT_CONV_CNT_MSK              (CSD_SEQ_NORM_CNT_CONV_CNT_Msk)

/* CSD_SEQ_START register masks */
#define `$INSTANCE_NAME`_CSD_SEQ_START_START_MSK                    (CSD_SEQ_START_START_Msk)
#define `$INSTANCE_NAME`_CSD_SEQ_START_SEQ_MODE_MSK                 (CSD_SEQ_START_SEQ_MODE_Msk)
#define `$INSTANCE_NAME`_CSD_SEQ_START_ABORT_MSK                    (CSD_SEQ_START_ABORT_Msk)
#define `$INSTANCE_NAME`_CSD_SEQ_START_DSI_START_EN_MSK             (CSD_SEQ_START_DSI_START_EN_Msk)
#define `$INSTANCE_NAME`_CSD_SEQ_START_AZ0_SKIP_MSK                 (CSD_SEQ_START_AZ0_SKIP_Msk)
#define `$INSTANCE_NAME`_CSD_SEQ_START_AZ1_SKIP_MSK                 (CSD_SEQ_START_AZ1_SKIP_Msk)

/* CSD_IDACA register masks */
#define `$INSTANCE_NAME`_CSD_IDACA_VAL_MSK                          (CSD_IDACA_VAL_Msk)
#define `$INSTANCE_NAME`_CSD_IDACA_VAL_POS                          (CSD_IDACA_VAL_Pos)

#define `$INSTANCE_NAME`_CSD_IDACA_POLARITY_MSK                     (CSD_IDACA_POLARITY_Msk)
#define `$INSTANCE_NAME`_CSD_IDACA_POLARITY_POS                     (CSD_IDACA_POLARITY_Pos)
#define `$INSTANCE_NAME`_CSD_IDACA_POLARITY_VSSA_SRC                (0uL)
#define `$INSTANCE_NAME`_CSD_IDACA_POLARITY_VDDA_SNK                (1uL)
#define `$INSTANCE_NAME`_CSD_IDACA_POLARITY_SENSE                   (2uL)
#define `$INSTANCE_NAME`_CSD_IDACA_POLARITY_SENSE_INV               (3uL)

#define `$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_MSK                    (CSD_IDACA_BAL_MODE_Msk)
#define `$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_POS                    (CSD_IDACA_BAL_MODE_Pos)
#define `$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_FULL                   (0uL)
#define `$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_PHI1                   (1uL)
#define `$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_PHI2                   (2uL)
#define `$INSTANCE_NAME`_CSD_IDACA_BALL_MODE_PHI1_2                 (3uL)

#define `$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_MSK                    (CSD_IDACA_LEG1_MODE_Msk)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_POS                    (CSD_IDACA_LEG1_MODE_Pos)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_GP_STATIC              (0uL)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_GP                     (1uL)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_CSD_STATIC             (2uL)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG1_MODE_CSD                    (3uL)

#define `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_MSK                    (CSD_IDACA_LEG2_MODE_Msk)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_POS                    (CSD_IDACA_LEG2_MODE_Pos)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_GP_STATIC              (0uL)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_GP                     (1uL)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_CSD_STATIC             (2uL)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG2_MODE_CSD                    (3uL)

#define `$INSTANCE_NAME`_CSD_IDACA_RANGE_MSK                        (CSD_IDACA_RANGE_Msk)
#define `$INSTANCE_NAME`_CSD_IDACA_RANGE_POS                        (CSD_IDACA_RANGE_Pos)
#define `$INSTANCE_NAME`_CSD_IDACA_RANGE_IDAC_LO                    (0uL)
#define `$INSTANCE_NAME`_CSD_IDACA_RANGE_IDAC_MED                   (1uL)
#define `$INSTANCE_NAME`_CSD_IDACA_RANGE_IDAC_HI                    (2uL)

#define `$INSTANCE_NAME`_CSD_IDACA_LEG1_EN_MSK                      (CSD_IDACA_LEG1_EN_Msk)
#define `$INSTANCE_NAME`_CSD_IDACA_LEG2_EN_MSK                      (CSD_IDACA_LEG2_EN_Msk)

/* CSD_IDACB register masks */
#define `$INSTANCE_NAME`_CSD_IDACB_VAL_MSK                          (CSD_IDACB_VAL_Msk)
#define `$INSTANCE_NAME`_CSD_IDACB_VAL_POS                          (CSD_IDACB_VAL_Pos)

#define `$INSTANCE_NAME`_CSD_IDACB_POLARITY_MSK                     (CSD_IDACB_POLARITY_Msk)
#define `$INSTANCE_NAME`_CSD_IDACB_POLARITY_POS                     (CSD_IDACB_POLARITY_Pos)
#define `$INSTANCE_NAME`_CSD_IDACB_POLARITY_VSSA_SRC                (0uL)
#define `$INSTANCE_NAME`_CSD_IDACB_POLARITY_VDDA_SNK                (1uL)
#define `$INSTANCE_NAME`_CSD_IDACB_POLARITY_SENSE                   (2uL)
#define `$INSTANCE_NAME`_CSD_IDACB_POLARITY_SENSE_INV               (3uL)

#define `$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_MSK                    (CSD_IDACB_BAL_MODE_Msk)
#define `$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_POS                    (CSD_IDACB_BAL_MODE_Pos)
#define `$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_FULL                   (0uL)
#define `$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_PHI1                   (1uL)
#define `$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_PHI2                   (2uL)
#define `$INSTANCE_NAME`_CSD_IDACB_BALL_MODE_PHI1_2                 (3uL)

#define `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_MSK                    (CSD_IDACB_LEG1_MODE_Msk)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_POS                    (CSD_IDACB_LEG1_MODE_Pos)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_GP_STATIC              (0uL)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_GP                     (1uL)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_CSD_STATIC             (2uL)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG1_MODE_CSD                    (3uL)

#define `$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_MSK                    (CSD_IDACB_LEG2_MODE_Msk)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_POS                    (CSD_IDACB_LEG2_MODE_Pos)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_GP_STATIC              (0uL)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_GP                     (1uL)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_CSD_STATIC             (2uL)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG2_MODE_CSD                    (3uL)

#define `$INSTANCE_NAME`_CSD_IDACB_RANGE_MSK                        (CSD_IDACB_RANGE_Msk)
#define `$INSTANCE_NAME`_CSD_IDACB_RANGE_POS                        (CSD_IDACB_RANGE_Pos)
#define `$INSTANCE_NAME`_CSD_IDACB_RANGE_IDAC_LO                    (0uL)
#define `$INSTANCE_NAME`_CSD_IDACB_RANGE_IDAC_MED                   (1uL)
#define `$INSTANCE_NAME`_CSD_IDACB_RANGE_IDAC_HI                    (2uL)

