BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Sensing.h
#define `$INSTANCE_NAME`_CSD_IDACB_LEG1_EN_MSK                      (CSD_IDACB_LEG1_EN_Msk)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG2_EN_MSK                      (CSD_IDACB_LEG2_EN_Msk)
#define `$INSTANCE_NAME`_CSD_IDACB_LEG3_EN_MSK                      (CSD_IDACB_LEG3_EN_Msk)

/***************************************
* PRS & LFSR masks
***************************************/
#define `$INSTANCE_NAME`_LFSR_TABLE_SIZE                            (4u)

#define `$INSTANCE_NAME`_PRS_LENGTH_2_BITS                          (0x00000003Lu)
#define `$INSTANCE_NAME`_PRS_LENGTH_3_BITS                          (0x00000007Lu)
#define `$INSTANCE_NAME`_PRS_LENGTH_4_BITS                          (0x0000000FLu)
#define `$INSTANCE_NAME`_PRS_LENGTH_5_BITS                          (0x0000001FLu)
#define `$INSTANCE_NAME`_PRS_LENGTH_8_BITS                          (0x000000FFLu)
#define `$INSTANCE_NAME`_PRS_LENGTH_12_BITS                         (0x00000FFFLu)

#define `$INSTANCE_NAME`_SNSCLK_SSC1_PERIOD                         (63u)
#define `$INSTANCE_NAME`_SNSCLK_SSC2_PERIOD                         (127u)
#define `$INSTANCE_NAME`_SNSCLK_SSC3_PERIOD                         (511u)
#define `$INSTANCE_NAME`_SNSCLK_SSC4_PERIOD                         (1023u)

#define `$INSTANCE_NAME`_SNSCLK_SSC1_RANGE                          (16u)
#define `$INSTANCE_NAME`_SNSCLK_SSC2_RANGE                          (16u)
#define `$INSTANCE_NAME`_SNSCLK_SSC3_RANGE                          (16u)
#define `$INSTANCE_NAME`_SNSCLK_SSC4_RANGE                          (16u)

#define `$INSTANCE_NAME`_LFSR_DITHER_PERCENTAGE                     (10uL)
#define `$INSTANCE_NAME`_SNSCLK_SSC1_THRESHOLD                      (`$INSTANCE_NAME`_LFSR_DITHER_PERCENTAGE * `$INSTANCE_NAME`_SNSCLK_SSC1_RANGE)
#define `$INSTANCE_NAME`_SNSCLK_SSC2_THRESHOLD                      (`$INSTANCE_NAME`_LFSR_DITHER_PERCENTAGE * `$INSTANCE_NAME`_SNSCLK_SSC2_RANGE)
#define `$INSTANCE_NAME`_SNSCLK_SSC3_THRESHOLD                      (`$INSTANCE_NAME`_LFSR_DITHER_PERCENTAGE * `$INSTANCE_NAME`_SNSCLK_SSC3_RANGE)
#define `$INSTANCE_NAME`_SNSCLK_SSC4_THRESHOLD                      (`$INSTANCE_NAME`_LFSR_DITHER_PERCENTAGE * `$INSTANCE_NAME`_SNSCLK_SSC4_RANGE)
#define `$INSTANCE_NAME`_HFCLK_SNSCLK_FACTOR                        (160uL)

/* Clock register masks    */
#define `$INSTANCE_NAME`_MODCLK_CMD_DIV_SHIFT                       (0uL)
#define `$INSTANCE_NAME`_MODCLK_CMD_PA_DIV_SHIFT                    (8uL)
#define `$INSTANCE_NAME`_MODCLK_CMD_DISABLE_SHIFT                   (30uL)
#define `$INSTANCE_NAME`_MODCLK_CMD_ENABLE_SHIFT                    (31uL)
#define `$INSTANCE_NAME`_MODCLK_CMD_DISABLE_MASK                    ((uint32)(1uL << `$INSTANCE_NAME`_MODCLK_CMD_DISABLE_SHIFT))
#define `$INSTANCE_NAME`_MODCLK_CMD_ENABLE_MASK                     ((uint32)(1uL << `$INSTANCE_NAME`_MODCLK_CMD_ENABLE_SHIFT))

#define `$INSTANCE_NAME`_HSIOM_SEL_MASK                             (GPIO_HSIOM_MASK)
#define `$INSTANCE_NAME`_HSIOM_SEL_GPIO                             (HSIOM_SEL_GPIO)
#define `$INSTANCE_NAME`_HSIOM_SEL_CSD_SENSE                        (HSIOM_SEL_ACT_3)
#define `$INSTANCE_NAME`_HSIOM_SEL_CSD_SHIELD                       (HSIOM_SEL_ACT_2)
#define `$INSTANCE_NAME`_HSIOM_SEL_AMUXA                            (HSIOM_SEL_AMUXA)
#define `$INSTANCE_NAME`_HSIOM_SEL_AMUXB                            (HSIOM_SEL_AMUXB)

/***************************************
* API Constants
***************************************/

/* Multi-scanning types and constants */

typedef struct{
    uint32 feedback;
    uint32 reference;
    uint32 output;
    cy_stc_fll_manual_config_t  fllManualCfg;
    cy_en_fll_pll_output_mode_t outputMode;
}`$INSTANCE_NAME`_PLL_FLL_CFG_TYPE;

#define `$INSTANCE_NAME`_FREQ_CHANNEL_0                             (0u)
#define `$INSTANCE_NAME`_FREQ_CHANNEL_1                             (1u)
#define `$INSTANCE_NAME`_FREQ_CHANNEL_2                             (2u)

/* Scanning status bit-mask */
#define `$INSTANCE_NAME`_SW_STS_BUSY                                (`$INSTANCE_NAME`_STATUS_CSD0_MASK)
#define `$INSTANCE_NAME`_NOT_BUSY                                   (0uL)

#define `$INSTANCE_NAME`_WDGT_SW_STS_BUSY                           (`$INSTANCE_NAME`_STATUS_WDGT0_BUSY_MASK)

#define `$INSTANCE_NAME`_PERCENTAGE_100                             (0x00000064uL)
#define `$INSTANCE_NAME`_DISCONNECT_IO_FLAG                         (1u)

/* State Definition for `$INSTANCE_NAME`_SetPinState() */
#define `$INSTANCE_NAME`_GROUND                                     (0uL)
#define `$INSTANCE_NAME`_HIGHZ                                      (1uL)
#define `$INSTANCE_NAME`_SHIELD                                     (2uL)
#define `$INSTANCE_NAME`_SENSOR                                     (3uL)
#define `$INSTANCE_NAME`_TX_PIN                                     (4uL)
#define `$INSTANCE_NAME`_RX_PIN                                     (5uL)

#if !(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_STANDALONE_EN)
/***************************************
* Global software/external variables
***************************************/
extern volatile uint8 `$INSTANCE_NAME`_widgetIndex;
extern volatile uint8 `$INSTANCE_NAME`_sensorIndex;
extern uint8 `$INSTANCE_NAME`_requestScanAllWidget;

extern `$INSTANCE_NAME`_RAM_SNS_STRUCT *`$INSTANCE_NAME`_curRamSnsPtr;

#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_CSX_EN) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN))
    extern `$INSTANCE_NAME`_SENSE_METHOD_ENUM `$INSTANCE_NAME`_currentSenseMethod;
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_CSX_EN) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN)) */

#if(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
    extern uint8 `$INSTANCE_NAME`_scanFreqIndex;
    extern `$INSTANCE_NAME`_PLL_FLL_CFG_TYPE `$INSTANCE_NAME`_immunity[`$INSTANCE_NAME`_NUM_SCAN_FREQS];

#else
    extern const uint8 `$INSTANCE_NAME`_scanFreqIndex;
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_EN))
    extern `$INSTANCE_NAME`_FLASH_WD_STRUCT const *`$INSTANCE_NAME`_curFlashWdgtPtr;
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_EN))  */

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)
    /*  Pointer to Flash structure holding info of sensor to be scanned  */
    extern `$INSTANCE_NAME`_FLASH_SNS_STRUCT const *`$INSTANCE_NAME`_curFlashSnsPtr;
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_GANGED_SNS_EN)  */

#if (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE)
    extern uint8 `$INSTANCE_NAME`_prescalersTuningDone;
#endif /* (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) */

extern `$INSTANCE_NAME`_FLASH_IO_STRUCT const *`$INSTANCE_NAME`_curSnsIOPtr;

