BasileBerckmoes/RobotComp2ELO/Software/PSoc/Roadster/RoadsterRACEMODE/CyComponentLibrary.cylib/CapSense_v1_0/API/CapSense_Sensing.h
/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/**
* \if SECTION_CAPSENSE_HIGH_LEVEL
* \addtogroup group_capsense_high_level
* \{
*/

cy_status `$INSTANCE_NAME`_SetupWidget(uint32 widgetId);
cy_status `$INSTANCE_NAME`_Scan(void);
cy_status `$INSTANCE_NAME`_ScanAllWidgets(void);
uint32   `$INSTANCE_NAME`_IsBusy(void);

/** \}
* \endif */

/**
* \if SECTION_CAPSENSE_LOW_LEVEL
* \addtogroup group_capsense_low_level
* \{
*/

void `$INSTANCE_NAME`_SetPinState(uint32 widgetId, uint32 sensorElement, uint32 state);

#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN))
cy_status `$INSTANCE_NAME`_CalibrateWidget(uint32 widgetId);
cy_status `$INSTANCE_NAME`_CalibrateAllWidgets(void);
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_IDAC_AUTOCAL_EN) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN))  */

/** \}
* \endif */

/**
* \if SECTION_CAPSENSE_INTERNAL
* \addtogroup group_capsense_internal
* \{
*/

cy_status `$INSTANCE_NAME`_SsInitialize(void);
void `$INSTANCE_NAME`_SsSetSnsClockDivider(uint32 snsClk);
void `$INSTANCE_NAME`_SsSetSnsFirstPhaseWidth(uint32 phaseWidth);
void `$INSTANCE_NAME`_SsSetClockDividers(uint32 snsClk, uint32 modClk);
void `$INSTANCE_NAME`_SsIsrInitialize(cy_israddress address);
void `$INSTANCE_NAME`_SsPostAllWidgetsScan(void);
void `$INSTANCE_NAME`_SsSetIOsInDefaultState(void);

#if ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_CSX_EN) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN) || \
     (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN))
    void `$INSTANCE_NAME`_SsSwitchSensingMode(`$INSTANCE_NAME`_SENSE_METHOD_ENUM mode);
#endif  /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_CSX_EN) || \
            (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_SELF_TEST_EN) || \
            (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN)) */

#if (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE)
    cy_status `$INSTANCE_NAME`_SsAutoTune(void);
#endif /* (`$INSTANCE_NAME`_CSD_SS_DIS != `$INSTANCE_NAME`_CSD_AUTOTUNE) */

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN)
    cy_status `$INSTANCE_NAME`_SsImmunityTblInit(uint32 clkSrcFreqHz);
    cy_status `$INSTANCE_NAME`_SsCalcFllDividers(uint32 inputFreq, uint32 outputFreq, `$INSTANCE_NAME`_PLL_FLL_CFG_TYPE *fllCfg);
    cy_status `$INSTANCE_NAME`_SsCalcPllDividers(uint32 inputFreq, uint32 outputFreq, `$INSTANCE_NAME`_PLL_FLL_CFG_TYPE *pllCfg);
    void `$INSTANCE_NAME`_SsChangeClkFreq(uint32 value);
#endif  /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_MULTI_FREQ_SCAN_EN) */

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN)
    cy_status `$INSTANCE_NAME`_SsReleaseResources(void);
#endif  /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_EN) */
#if((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN) || \
    (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_EN))
    void `$INSTANCE_NAME`_SsInitializeSourceSenseClk(void);
#endif /* ((`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN) || \
           (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSX_EN)) */

#if (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN)
    void `$INSTANCE_NAME`_SsClearCSDSensors(void);
    uint32 `$INSTANCE_NAME`_SsCSDGetColSnsClkDivider(uint32 widgetId);
    #if (`$INSTANCE_NAME`_ENABLE == (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN || `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN))
        uint32 `$INSTANCE_NAME`_SsCSDGetRowSnsClkDivider(uint32 widgetId);
    #endif /* (`$INSTANCE_NAME`_ENABLE == (`$INSTANCE_NAME`_CSD_MATRIX_WIDGET_EN | `$INSTANCE_NAME`_CSD_TOUCHPAD_WIDGET_EN)) */
    #if (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE)
        uint8 `$INSTANCE_NAME`_SsCSDCalcPrsSize(uint32 snsClkDivider, uint32 resolution);
    #endif /* (`$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO == `$INSTANCE_NAME`_CSD_SNS_CLK_SOURCE) */
#endif /* (`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_CSD_EN) */

/** \}
* \endif */
#endif  /* !(`$INSTANCE_NAME`_ENABLE == `$INSTANCE_NAME`_ADC_STANDALONE_EN) */

#endif /* End CY_CAPSENSE_`$INSTANCE_NAME`_SENSING_H */


/* [] END OF FILE */
